""" მოცემულია სია (list): numbers = [16, 75, 15, 180, 145, 54, 50]
დაწერეთ პროგრამა for ციკლის გამოყენებით, სადაც:
○ თუ სიაში მოცემული რიცხვი მეტია 100-ზე, გამოტოვებთ იტერაციას და
გადახვალთ სიაში მოცემულ შემდეგ რიცხვზე.
○ დაბეჭდავთ სიიდან იმ რიცხვებს, რომლებიც 5-ზე იყოფიან უნაშთოდ.
○ თუ სიაში მოცემული რიცხვი იქნება 54, შეწყვეტთ ციკლს. """

numbers = [16, 75, 15, 180, 145, 54, 50]

for i in numbers:
    if i == 54:
        break
    elif i > 100:
        continue
    elif i % 5 == 0:
        print(i)
